//--------------------------------Управление положением курсора--------->
 
    //    \033[#A передвинуть курсор вверх на # строк
    //    \033[#B передвинуть курсор вниз на # строк
    //    \033[#С передвинуть курсор вправо на # столбцов
    //    \033[#D передвинуть курсор влево на # столбцов
    //    \033[#E передвинуть курсор вниз на # строк и поставить в начало строки
    //    \033[#F передвинуть курсор вверх на # строк и поставить в начало строки
    //    \033[#G переместить курсор в указанный столбец текущей строки
    //    \033[#;#H задает абсолютные координаты курсора (строка, столбец)
    //    \033]2;BLA_BLA\007   Заголовок окна xterm...

